{
  "profiles": [
    {
      "name": "Elektrotehničar informacionih tehnologija",
      "description": "Elektrotehničar informacionih tehnologija je obrazovni profil koji priprema učenike za rad u oblasti IT industrije. Fokusira se na razvoj softverskih aplikacija, kreiranje baza podataka, kao i dizajn i implementaciju statičkih i dinamičkih web stranica. Učenici se takođe osposobljavaju za održavanje i zaštitu informacionih sistema, što ih čini konkurentnim na tržištu rada u sektoru tehnologije i digitalnih rešenja.",
      "imagePath": "/images/profiles/elektrotehnicar-informacionih-tehnologija.png"
    },
    {
      "name": "Administrator računarskih mreža",
      "description": "Ovaj obrazovni profil omogućava učenicima da steknu veštine u oblasti administracije računarskih mreža. Uči ih kako da postavljaju, održavaju i nadgledaju mrežnu opremu, kao i kako da obezbede sigurnost mrežnih sistema. Takođe, učenici se osposobljavaju za rad sa različitim operativnim sistemima i dijagnostiku mrežnih problema, što je ključno za rad u firmama koje koriste računarske mreže i internet servise.",
      "imagePath": "/images/profiles/administrator-racunarskih-mreza.png"
    },
    {
      "name": "Elektrotehničar računara",
      "description": "Profil elektrotehničara računara obuhvata rad sa računarima, kako na hardverskom, tako i na softverskom nivou. Učenici se obučavaju za konfiguraciju računarskih sistema, programiranje na različitim jezicima, kao i za rad sa bazama podataka i računarima povezanim u mreže. Ovaj profil pruža znanja koja omogućavaju rad u industriji, nauci, medicini i drugim sektorima gde su računari ključni za obradnu i analizu podataka.",
      "imagePath": "/images/profiles/elektrotehnicar-racunara.png"
    },
    {
      "name": "Elektrotehničar automatike",
      "description": "Elektrotehničar automatike je profil koji priprema učenike za rad sa automatizovanim sistemima u industriji. Učenici stiču znanje o projektovanju, održavanju i nadzoru industrijskih automatizovanih sistema, upravljanju mašinama i robotima, kao i kontroli proizvodnih procesa. Ovaj smer je ključan za industrije koje se bave proizvodnjom, energetikom i drugim oblastima gde je potrebna visoka preciznost i efikasnost u radu.",
      "imagePath": "/images/profiles/elektrotehnicar-automatike.png"
    },
    {
      "name": "Elektromehaničar za rashladne i termičke uređaje",
      "description": "Elektromehaničar za rashladne i termičke uređaje obučava učenike za rad sa različitim vrstama rashladnih i klimatskih uređaja, kao i za montažu, održavanje i popravku ovih sistema. Učenici stiču znanja o električnim instalacijama, termalnim procesima i uređajima koji koriste termalne i rashladne sisteme. Ovaj profil pruža praktične veštine za rad u industriji, domaćinstvima i servisima za klimatizaciju i hlađenje.",
      "imagePath": "/images/profiles/elektromehanicar-za-rashladne-i-termicke-uredjaje.png"
    }
  ]
}
